2019/java-spi.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-10-07 周一 16:53 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java SPI 机制及其实现</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Java SPI 机制及其实现</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1265b78">1. 前言</a></li>
<li><a href="#orgf8c290e">2. ServiceLoader</a></li>
<li><a href="#orgb46f506">3. JDBC 中的使用</a></li>
<li><a href="#org811977e">4. 更多的使用场景</a></li>
<li><a href="#org88cb78a">5. 实现原理</a></li>
<li><a href="#org20dc208">6. SpringFactoriesLoader</a></li>
<li><a href="#orgae0eae9">7. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1265b78" class="outline-2">
<h2 id="org1265b78"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
第一次接触 SPI 是在看《Java 核心计算卷》中 JDBC 相关的章节的时候，当时看到说在高版本的 JDBC 中可以省略通过 <code>Class.forName</code> 加载驱动这一步，
因为高版本的 JDBC 可以通过 SPI 机制自动加载注册驱动。
</p>

<p>
当时看到的时候感觉很惊喜，终于不用写那又臭又长的 <code>try-catch</code> 了。
</p>

<p>
后来在阅读源码的过程中又发现 Spring 中也实现了类似于 Java SPI 机制的功能，研究了一下后发现 SPI 机制无论是在使用上还是在实现上，都是很简单的。
</p>

<p>
所以，我觉得，可以整一篇博客总结一下。
</p>

<details><summary><i>隐藏内容</i></summary>

<p>
上一次写博客还是 6 月 22 号，断更了 100 多天，感觉有点手生 @_@
</p>

</details>
</div>
</div>

<div id="outline-container-orgf8c290e" class="outline-2">
<h2 id="orgf8c290e"><span class="section-number-2">2</span> ServiceLoader</h2>
<div class="outline-text-2" id="text-2">
<p>
SPI 的全称为 (Service Provider Interface)，是 JDK 内置的一种服务提供发现机制。主要由工具类 <code>java.util.ServiceLoader</code> 提供相应的支持。  
</p>

<p>
其中的两个主要角色为：
</p>
<ul class="org-ul">
<li>Service - 服务，通常为一个接口或一个抽象类，具体类虽然也可以，但是一般不建议那样做</li>
<li>Service Provider - 服务提供者，服务的具体实现类</li>
</ul>

<p>
使用时，需要在 <code>META-INF/services</code> 下创建和服务的 <b>全限定名</b> 相同的文件，然后在该文件中写入 <b>服务提供者</b> 的全限定名，可以用 <code>#</code> 作为注释。比如说，
我们可以在文件 <code>mysql-connector-java/META-INF/services/java.sql.Driver</code> 中发现如下内容：
</p>
<pre class="example">
com.mysql.jdbc.Driver
com.mysql.fabric.jdbc.FabricMySQLDriver
</pre>

<p>
然后，就可以通过 <code>ServiceLoader</code> 来获取这些服务提供者。由于 ServiceLoader 并没有提供直接获取服务提供者的方法，因此，只能通过迭代的方式获取：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">ServiceLoader</span>&lt;<span class="org-type">Service</span>&gt; <span class="org-variable-name">loader</span> = ServiceLoader.load(Service.<span class="org-keyword">class</span>);

<span class="org-keyword">for</span> (<span class="org-type">Service</span> <span class="org-variable-name">service</span> : loader) {
  <span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
}
</pre>
</div>

<p>
可以看到，ServiceLoader 的使用还是很简单的，更多的和 ServiceLoader 相关的内容可以看一下官方文档：<a href="https://docs.oracle.com/javase/8/docs/api/java/util/ServiceLoader.html">ServiceLoader (Java Platform SE 8 )</a>
</p>
</div>
</div>

<div id="outline-container-orgb46f506" class="outline-2">
<h2 id="orgb46f506"><span class="section-number-2">3</span> JDBC 中的使用</h2>
<div class="outline-text-2" id="text-3">
<p>
如果要找一个使用了 SPI 机制的例子的话，最直接的就是 JDBC 中通过 SPI 的方式加载驱动了，这里可以看一下 JDBC 的使用方式：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">DriverManager</span> {
  <span class="org-keyword">static</span> {
    loadInitialDrivers();
  }

  <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">loadInitialDrivers</span>() {
    AccessController.doPrivileged(<span class="org-keyword">new</span> <span class="org-type">PrivilegedAction</span>&lt;<span class="org-type">Void</span>&gt;() {
        <span class="org-keyword">public</span> <span class="org-type">Void</span> <span class="org-function-name">run</span>() {

          <span class="org-type">ServiceLoader</span>&lt;<span class="org-type">Driver</span>&gt; <span class="org-variable-name">loadedDrivers</span> = ServiceLoader.load(Driver.<span class="org-keyword">class</span>);
          <span class="org-type">Iterator</span>&lt;<span class="org-type">Driver</span>&gt; <span class="org-variable-name">driversIterator</span> = loadedDrivers.iterator();

          <span class="org-keyword">try</span>{
            <span class="org-keyword">while</span>(driversIterator.hasNext()) {
              driversIterator.next();
            }
          } <span class="org-keyword">catch</span>(<span class="org-type">Throwable</span> <span class="org-variable-name">t</span>) {
            <span class="org-comment-delimiter">// </span><span class="org-comment">Do nothing</span>
          }
          <span class="org-keyword">return</span> <span class="org-constant">null</span>;
        }
      });
  }
}
</pre>
</div>

<p>
通过上面的简化过后的代码可以发现，在加载 <code>DriverManager</code> 这个类的时候就会通过静态初始化代码块调用执行 <code>loadInitialDrivers</code> 方法，而这个方法会通过 <code>ServiceLoader</code> 加载所有的 <code>Driver</code> 提供者。
</p>

<p>
而在相应的 Driver 提供类中，比如类 <code>com.mysql.jdbc.Driver</code> 中就存在如下形式的代码：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">static</span> {
  <span class="org-keyword">try</span> {
    <span class="org-constant">java</span>.<span class="org-constant">sql</span>.DriverManager.registerDriver(<span class="org-keyword">new</span> <span class="org-type">Driver</span>());
  } <span class="org-keyword">catch</span> (<span class="org-type">SQLException</span> <span class="org-variable-name">E</span>) {
    <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">RuntimeException</span>(<span class="org-string">"Can't register driver!"</span>);
  }
}
</pre>
</div>

<p>
是不是很简单？加载 DriverManager 的时候通过 SPI 机制加载各个 Driver，然后各个 Driver 又在它们自己的静态初始化代码块中将自己注册到 DriverManager。
</p>
</div>
</div>

<div id="outline-container-org811977e" class="outline-2">
<h2 id="org811977e"><span class="section-number-2">4</span> 更多的使用场景</h2>
<div class="outline-text-2" id="text-4">
<p>
通过 JDBC 中 SPI 机制的使用可以发现，要使用 SPI 的话还是很简单的，那么，我们可以在什么地方使用 SPI 呢？
</p>

<p>
由于 SPI 机制的限制，单个 ServiceLoader 只能加载单个类型的 Service，同时还必须创建相应的文件放到 <code>META-INF/services</code> 目录下，因此，使用场景最好就是类似 JDBC 中这种，
可以通过单个对象来访问其他服务提供者的场景，即：可以使用 <b>门面模式</b> 的场景。
</p>

<p>
比如说，现在 Java 中存在不少常用的 JSON 库，比如 Gson、FastJSON、Jackson 等，这些库在使用时都可以通过简单的封装来满足大部分的需求，那么，
我们就可以考虑通过 SPI 机制来实现一个这些 JSON 库的门面，将 JSON 的处理下放到 Service Provider 来完成，而我们通过门面来使用这些服务。
</p>

<p>
这样一来，我们一方面可以提供自己的默认实现，也可以留出扩展的接口，也就不需要自己手动去加载那些实现了。
</p>
</div>
</div>

<div id="outline-container-org88cb78a" class="outline-2">
<h2 id="org88cb78a"><span class="section-number-2">5</span> 实现原理</h2>
<div class="outline-text-2" id="text-5">
<p>
SPI 不仅在使用上很简单，它的实现原理也很简单，关键就在 <code>ClassLoader.getResources</code> 这个方法上，SPI 加载服务的方式就是通过 <code>ClassLoader.getResources</code> 方法找到 <code>META-INF/services</code> 目录下的相应文件，
然后解析文件得到服务提供者的类名。
</p>

<p>
最后通过 <code>Class.forName() -&gt; clazz.newInstance()</code> 得到实例返回。
</p>

<p>
非常简单且直白的实现方式，比较值得注意的就是 <code>ClassLoader.getResources</code> 方法的使用了，比如，你可以在一个 <code>Spring</code> 项目下执行如下代码：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Test</span> {
  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) <span class="org-keyword">throws</span> <span class="org-type">Exception</span> {
    <span class="org-type">Enumeration</span>&lt;<span class="org-type">URL</span>&gt; <span class="org-variable-name">urls</span> = Test.<span class="org-keyword">class</span>.getClassLoader().getResources(<span class="org-string">"META-INF/spring.factories"</span>);
    <span class="org-keyword">while</span> (urls.hasMoreElements()) {
      System.out.println(urls.nextElement());
    }
  }
}
</pre>
</div>

<p>
这个就是 Spring 中通过 <code>SpringFactoriesLoader</code> 来加载相关的类的起点。
</p>
</div>
</div>

<div id="outline-container-org20dc208" class="outline-2">
<h2 id="org20dc208"><span class="section-number-2">6</span> SpringFactoriesLoader</h2>
<div class="outline-text-2" id="text-6">
<p>
SpringFactoriesLoader 是 Spring 中十分重要的一个扩展机制之一，它的使用方式和实现原理和 SPI 十分相似，只不过，提供了更加强大的功能。
</p>

<p>
和 SPI 不同，由于 SpringFactoriesLoader 中的配置文件格式是 <code>properties</code> 文件，因此，不需要要像 SPI 中那样为每个服务都创建一个文件，
而是选择直接把所有服务都扔到 <code>META-INF/spring.factories</code> 文件中。
</p>

<p>
比如，spring-boot-autoconfigure 中的部分内容：
</p>
<div class="org-src-container">
<pre class="src src-conf"># Initializers
<span class="org-variable-name">org.springframework.context.ApplicationContextInitializer</span>=\
org.springframework.boot.autoconfigure.SharedMetadataReaderFactoryContextInitializer,\
org.springframework.boot.autoconfigure.logging.ConditionEvaluationReportLoggingListener

# Application Listeners
<span class="org-variable-name">org.springframework.context.ApplicationListener</span>=\
org.springframework.boot.autoconfigure.BackgroundPreinitializer

# Auto Configuration Import Listeners
<span class="org-variable-name">org.springframework.boot.autoconfigure.AutoConfigurationImportListener</span>=\
org.springframework.boot.autoconfigure.condition.ConditionEvaluationReportAutoConfigurationImportListener

# Auto Configuration Import Filters
<span class="org-variable-name">org.springframework.boot.autoconfigure.AutoConfigurationImportFilter</span>=\
org.springframework.boot.autoconfigure.condition.OnClassCondition

# ...
</pre>
</div>

<p>
更多的使用可以参考：<a href="https://docs.spring.io/spring/docs/current/javadoc-api/org/springframework/core/io/support/SpringFactoriesLoader.html">SpringFactoriesLoader (Spring Framework 5.2.0.RELEASE API)</a>
</p>
</div>
</div>

<div id="outline-container-orgae0eae9" class="outline-2">
<h2 id="orgae0eae9"><span class="section-number-2">7</span> 结语</h2>
<div class="outline-text-2" id="text-7">
<p>
总的来说，无论是 ServiceLoader 还是 SpringFactoriesLoader，它们的基本原理都是一样的，都是通过 <code>ClassLoader.getResources</code> 方法找到相应的配置文件，
然后解析文件得到服务提供者的全限定名。
</p>

<p>
得益于 Java 强大的反射机制，拿到全限定名后基本上就可以为所欲为了 @_@
</p>

<details><summary><i>隐藏内容</i></summary>

<p>
简陋的 JSON 门面：<a href="https://github.com/rgb-24bit/ruava/blob/master/ruava-support/src/main/java/com/rgbit/ruava/support/json/DefaultJsonProviderFactory.java">DefaultJsonProviderFactory.java</a>
</p>

</details>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
